let nums = [5, 10, 15, 20, 25, 30];
//let mid = nums.splice(2, 3); // начален индекс, брой стойности, които взима и в оригиналния изтрива (// startIndex, delete-count)

//let mid = nums.splice(-2); // започва да брои от края на масива (това се прави само с начален индекс). returns the removed item(s)

let mid = nums.splice(1, 0, 18); // вмъква пред индекс 1 числото 18 (на мястото на индекс 1)  1 е индекса, 0 е брой елементи, които трие, 18 числото, което вмъква. Числото на индекс 1 се измества на следващия индекс.

// let mid = nums.splice(2, 1, 18); // заменя числото на индекс 2 със 18 (ако броя на елементите е 2 (или повече), трие от индекс 2 съответния брой елементи и вмъква 18)

//mid = nums.splice(2); // взима стойностите от дадения индекс до края и в оригиналния масив ги трие до края

// изрязано копие от оригиналния масив
//console.log(`'copy' ${mid.join('|')}` );  // 15|20|25 парчето от масива (копие).

// оригинален масив
//console.log(`'original' ${nums.join('|')}`); // 5|10|30  това, което остава в оригиналния масив след отрязването на парче от него


// nums.splice(3, 2, "twenty", "twenty-five", "desi", "tralala"); // трие от трети индекс нататък два символа и на тяхно място залепва (вмъква) дадените елементи 

// nums.splice(3, 0, "twenty", "twenty-five", "desi", "tralala"); // пред 3ти индекс вмъква дадените елементи.

console.log(`'inserted' ${nums.join('|')}`); // 5|10|15|twenty|twenty-five|30


